##################################################################################################################################
# 1. Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
##################################################################################################################################

my_list = [1980, True, 'Moskow', '3.14', 5.5]
for i in my_list:
    print(f'{i} -  {type(i)}')
