########################################################################################################################
# 3. Реализовать функцию my_func(), которая принимает три позиционных аргумента и возвращает сумму наибольших двух аргументов.
########################################################################################################################

def my_func(num_1, num_2, num_3):
    num_list = (num_1, num_2, num_3)
    nums = sorted(num_list)
    return nums[-2] + nums[-1]


print(my_func(11, 10, 6))