########################################################################################################################
# 2. Создать текстовый файл (не программно), сохранить в нем несколько строк, выполнить подсчет количества строк,
# количества слов в каждой строке.
########################################################################################################################

out_f = open("task2.txt", "w")
str_list = ['1\n', 'Вторая строка\n', 'Я третья строка\n']
out_f.writelines(str_list)
out_f.close()

with open("task2.txt") as t:
    s = t.read().count('\n')
    print(f'Количество строк в файле {t.name} - {s}')

with open("task2.txt") as t:
    i = 1
    for line in t:
        w = len(line.split())
        print(f'Количество слов в строке {i} - {w}')
        i += 1