########################################################################################################################
#1. Создать программно файл в текстовом формате, записать в него построчно данные, вводимые пользователем.
# Об окончании ввода данных свидетельствует пустая строка.
########################################################################################################################

with open("task.txt", 'w') as f_obj:
    # string = str()
    while True:
        string = input('Введите данные: ')
        f_obj.write(f'{string}\n')
        if string == '':
            break
    print('Ввод завершен')